# GetSpatialElementDomainData Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElement..::..GetSpatialElementDomainData Method
SpatialElement Class See Also
---
Gets the domain data for the spatial element. The domain data contains information of different spatial elements, such as electrical load area. Currently room/space/area don't have domain data.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public SpatialElementDomainData GetSpatialElementDomainData()
```

Visual Basic
---
```text
Public Function GetSpatialElementDomainData As SpatialElementDomainData
```

Visual C++
---
```text
public:
SpatialElementDomainData^ GetSpatialElementDomainData()
```

# ### Return Value
Returns a pointer to the base class for specific domain requirements for the spatial element.
# See Also
SpatialElement Class
Autodesk.Revit.DB Namespace